/**
  ******************************************************************************
  * @file    Gimbal_Task.c
  * @author  26赛季，平衡步兵电控，林宸曳
  * @date    2025.9.19
  * @brief   云台控制任务
  ******************************************************************************
*/

/****************************头文件引用****************************/
#include <FreeRTOS.h>
#include <task.h>
#include "GlobalDeclare_General.h"
#include "GlobalDeclare_Gimbal.h"


static TickType_t S_lastWakeTimeGimbalTask = 0; //上次唤醒的时间，DelayUntil绝对延时函数的参数

/**
  * @brief  Gimbal底盘控制任务
  * @note   云台的控制任务函数
  *         while(1)是因为FreeRTOS的任务函数必须是一个死循环
  * @param  无
  * @retval 无
  */
void GimbalTask(void* arg)
{
    while(1)
    {
        // GimbalControl();       //云台的总控制   //待完成

        GST_SystemMonitor.GimbalTask_cnt++;		//底盘帧率统计：cnt计数
        vTaskDelayUntil(&S_lastWakeTimeGimbalTask, GGB_TaskPeriod); //绝对延时
    }
}


//待修改
/*测试时的分割线---------------------------------------------------------------------------------------------*/
//待修改

/**
  * @brief  底盘控制函数
  * @param  无
  * @retval 无
*/
void GimbalControl(void)
{
    /*********************测试时使用1上边界***********************************************************************************************/

    /*********************测试时使用1下边界***********************************************************************************************/
    

    /*********************测试时使用2上边界***********************************************************************************************/


    /*********************测试时使用2下边界***********************************************************************************************/

}


