/**
  ******************************************************************************
  * @file    RM_BSP.c
  * @author  26赛季，平衡步兵电控，林宸曳
  * @date    2025.9.20
  * @brief   所有底层外设、单片机的配置函数写在这里。
  ******************************************************************************
*/

/****************************头文件引用****************************/
#include "CAN_Config.h"
#include "Delay_Config.h"
#include "USART_Config.h"
#include "TIM_Config.h"
#include "WWDG_Config.h"
#include "CAN_Communication.h"

/**
  * @brief  CAN发送0电流的函数
  * @note   用来在初始化时向电机发送0，以防上电时电机乱转
  * @param  无
  * @retval 无
*/
//待优化：这里的注释也写得很糟糕，后面得改一改
//待修改：新代码需要根据电机通讯的ID号重新写
//换车需修改
void _BSPInit_CANSendZeroCurrent(void)
{
    for(uint8_t i = 0; i<50; i++)
    {
        //应该是云台的pitch、yaw、摩擦轮等等
        CAN_Send(CAN1,0x200,0,0,0,0);
        CAN_Send(CAN1,0x1FF,0,0,0,0);   //负Pitch，左摩擦轮，右摩擦轮，拨盘

        //轮毂电机、
        CAN_Send(CAN2,0x200,0,0,0,0);   //右轮,左轮,0,0
        CAN_Send(CAN2,0x1FF,0,0,0,0);   //这是什么，不太清楚
        Delay_ms_Unexact(1);
    }
}

/**
  * @brief  STM32底层外设的初始化函数
  * @note   中断优先级分组为4组，抢占优先级0~15，响应优先级不配置（因为使用了FreeRTOS）
  * @param  无
  * @retval 无
*/
void BSP_All_Init(void)
{
    /**************************************** 中断优先级分组配置 ****************************************/
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);//中断分组4组，抢占可配置0~15，响应不配置
    
    /**************************************** CAN ****************************************/
    My_CAN1_Init();
    My_CAN2_Init();
    _BSPInit_CANSendZeroCurrent();//初始化时向电机发送0，以防上电时电机乱转

    /**************************************** 串口 ****************************************/
    My_USART1_Init(); //遥控接收机DR16
    My_USART2_Init(); //云台云控IMU1
    My_USART3_Init(); //Debug
    My_UART4_Init();  //底盘云控IMU2 
    // My_UART5_Init(); //裁判系统  //待修改：没有对UART5接收做处理的时候，初始化会让程序卡死，等待后面处理完再打开
    My_USART6_Init(); //视觉

    /**************************************** TIM ****************************************/
    My_TIM5_Init(); //TIM5，用来当作系统计时器使用

    /**************************************** WWDG ****************************************/
    My_WWDG_Init();  //窗口看门狗，喂狗时间大概0~9ms
}

