/**
  ******************************************************************************
  * @file    WWDG_Config.h
  * @author  26赛季，平衡步兵电控，林宸曳
  * @date    2025.9.21
  * @brief   窗口看门狗的初始化头文件
  ******************************************************************************
*/
#ifndef __WWDG_CONFIG_H
#define __WWDG_CONFIG_H

#include "stdint.h"

/****************************变量引出extern声明****************************/
extern const uint8_t WWDG_CounterValue;

/****************************函数声明****************************/
void My_WWDG_Init(void);

#endif
